DataProcessors/ТоварыНаКонтролеКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТоварыНаКонтролеКачества</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СрокКонтроля</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемаяПартия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заблокировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПроцессеПеремещения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвободныйОстатокНаСкладе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗаявкаНаКонтроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/АктКонтроляКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктКонтроляКачестваТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровНаСклад</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтХранителя</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ЗаявкаНаКонтрольКачестваТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАктовКонтроляКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКонтрольКачестваТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперацияПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерПартии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПартии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияПоТоварамВАктеКонтроляКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиКачества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиКачестваТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодНазначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОприходование</Name>
							<Comment>Количество приходуемое (в единицах хранения)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыИсследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исследование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ТоварыНаКонтролеКачества/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	ИнициализацияНастройкиСписка();
	Элементы.НастройкиОтбор.Видимость = УстановленОтбор();
	// Обработчик механизма "Назначения".
	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтотОбъект);
	ЗаявкаОформлена = Неопределено;
	ИспользуютсяИсследованияТоваров = ИспользуютсяИсследованияТоваров();
	ГиперссылкаПриАктивизации(АктивнаяГиперссылка(ЗаявкаОформлена).Имя, Истина);
	ВосстановитьНастройкиФормыПриСоздании();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	ПриИзмененииОтбораНаСервере();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ПриИзмененииОтбораНаСервере();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ПриИзмененииОтбораНаСервере();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Данные = Неопределено;
	
	Если Поле = Элементы.ТоварыКонтролируемаяПартия Тогда
		
		Данные = РеквизитПартия(Элемент.ТекущиеДанные.КонтролируемаяПартия)
		
	ИначеЕсли Поле = Элементы.ТоварыЗаблокировано И Элемент.ТекущиеДанные.ЕстьВПроцессеПеремещения Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Есть незавершенное перемещение заблокированного товара.'"));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		ПоказатьЗначение(, Данные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеГиперссылка(Команда)
	
	ГиперссылкаПриАктивизации(Элементы.ВсеГиперссылка.Имя);
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаОформленаГиперссылка(Команда)
	
	ГиперссылкаПриАктивизации(Элементы.ЗаявкаОформленаГиперссылка.Имя);
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНеОформленаГиперссылка(Команда)
	
	ГиперссылкаПриАктивизации(Элементы.ЗаявкаНеОформленаГиперссылка.Имя);
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьАктКонтроляКачества(Команда)
	
	ВыбранныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одной строки списка товаров. Команда не выполнена'"));
		Возврат;
		
	КонецЕсли;
	
	КонтролируемаяПартия = Объект.Товары.НайтиПоИдентификатору(ВыбранныеСтроки[0]).КонтролируемаяПартия;
	Для Каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		Если Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока).КонтролируемаяПартия <> КонтролируемаяПартия Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать строки, относящиеся к одной контролируемой партии. Один ""Акт контроля качества"" на несколько контролируемых партий не может быть создан.'"));
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Аналитики = ПоместитьАналитикиВХранилище(Ложь);
	ОткрытьФорму(
		"Документ.АктКонтроляКачестваТоваров.Форма.ФормаДокумента",
		Новый Структура("ЗаполнитьПоОстаткам,Аналитики", Истина, Аналитики),
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаявкуНаКонтрольКачества(Команда)
	
	Если Элементы.Товары.ВыделенныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одной строки списка товаров. Команда не выполнена'"));
		Возврат;
		
	КонецЕсли;
	
	ЕстьСтроки = Ложь;
	Для Каждого Идентификатор Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		Если Не Объект.Товары.НайтиПоИдентификатору(Идентификатор).ЭтоЗаявкаНаКонтроль Тогда
			ЕстьСтроки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьСтроки Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Заявку на контроль качества товаров нельзя создать для контролируемых партий, связанных с другими заявками на контроль качества товаров.'"));
		Возврат;
		
	КонецЕсли;
	
	Аналитики = ПоместитьАналитикиВХранилище(Истина);
	ДанныеЗаполнения = КонтрольКачестваКлиентСервер.НовыеДанныеЗаполненияЗаявкиНаКонтрольКачестваТоваров();
	ДанныеЗаполнения.ПричинаБлокировкиТовара
		= ПредопределенноеЗначение("Справочник.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара");
	
	ОткрытьФорму(
		"Документ.ЗаявкаНаКонтрольКачестваТоваров.Форма.ФормаДокумента",
		Новый Структура("ЗаполнитьПоОстаткам,Аналитики,ДанныеЗаполнения", Истина, Аналитики, ДанныеЗаполнения),
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗапуститьЗаданиеЗагрузитьТовары();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура АктыКонтроляКачества(Команда)
	
	ОткрытьФорму("Документ.АктКонтроляКачестваТоваров.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаКонтрольКачества(Команда)
	
	Если ИспользуютсяИсследованияТоваров Тогда
		Возврат;
	Иначе
		ОткрытьФорму("Документ.ЗаявкаНаКонтрольКачестваТоваров.Форма.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСписок(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресСхемы", АдресСхемыКомпоновкиДанныхНастройкиСписка);
	ПараметрыФормы.Вставить("НастройкиСписка", НастройкиСписка);
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаСпискаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Отчет.НастройкаСписка.Форма.НастройкаСписка", ПараметрыФормы, , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиСписка(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючОбъекта", "ТоварыНаКонтролеКачества");
	ПараметрыФормы.Вставить("КлючНастроек", "ТоварыНаКонтролеКачества.НастройкаСписка");
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьНастройкиСпискаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ФормаСохраненияПользовательскихНастроекДинамическихСписков", 
			ПараметрыФормы,
			,
			,
			,
			, 
			ОписаниеОповещения, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройкиСписка(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючОбъекта", "ТоварыНаКонтролеКачества");
	ПараметрыФормы.Вставить("КлючНастроек", "ТоварыНаКонтролеКачества.НастройкаСписка");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьНастройкиСпискаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ФормаЗагрузкиПользовательскихНастроекДинамическихСписков", 
			ПараметрыФормы,
			,
			,
			,
			, 
			ОписаниеОповещения, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаСпискаТоваров

&НаСервере
Процедура ЗапуститьЗаданиеЗагрузитьТовары()
	
	Если РезультатВыполненияЗаданияЗаполненияТоваров <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанныхНастройкиСписка);
	
	// Загрузка СКД
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСписка.ПолучитьНастройки());
	КомпоновщикНастроек.Восстановить();
	
	ИспользуемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ИмяФункции = "Обработки.ТоварыНаКонтролеКачества.ВыполнитьЗаданиеЗаполненияТоваров";
	
	ПараметрыФункции = КонтрольКачестваКлиентСервер.ПараметрыЗаполненияТоваровДляКонтроляКачества();
	ПараметрыФункции.Отбор.Склад = ?(ЗначениеЗаполнено(Склад), Склад, Неопределено);
	ПараметрыФункции.Отбор.Номенклатура = ?(ЗначениеЗаполнено(Номенклатура), Номенклатура, Неопределено);
	ПараметрыФункции.Отбор.Назначение = ?(ЗначениеЗаполнено(Назначение), Назначение, Неопределено);
	ПараметрыФункции.Отбор.ЗаявкаОформлена = ?(ЗначениеЗаполнено(ЗаявкаОформлена), ЗаявкаОформлена, Неопределено);
	ПараметрыФункции.НастройкиКомпоновки = ИспользуемыеНастройки;
	
	РезультатВыполненияЗаданияЗаполненияТоваров = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, ИмяФункции, ПараметрыФункции);
	
	Если РезультатВыполненияЗаданияЗаполненияТоваров.Статус = "Выполнено" Тогда
		ЗагрузитьТовары(РезультатВыполненияЗаданияЗаполненияТоваров.АдресРезультата);
		РезультатВыполненияЗаданияЗаполненияТоваров = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров()
	
	Если РезультатВыполненияЗаданияЗаполненияТоваров <> Неопределено Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ФормаВладелец = ЭтотОбъект;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьТоварыОбработчикОповещения", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РезультатВыполненияЗаданияЗаполненияТоваров, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТоварыОбработчикОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполненияЗаданияЗаполненияТоваров = Неопределено;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗагрузитьТовары(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТовары(АдресХранилища)
	
	Таблица = ПолучитьИзВременногоХранилища(АдресХранилища);
	Объект.Товары.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтбораНаСервере()
	
	СохранитьНастройкиФормы();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиФормы

&НаСервере
Процедура ВосстановитьНастройкиФормыПриСоздании()
	
	НастройкиФормы = ХранилищеНастроекДанныхФорм.Загрузить(
		МенеджерНастроекКлючОбъекта(), МенеджерНастроекКлючНастроек());
	Если ЗначениеЗаполнено(НастройкиФормы) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	НастройкиФормы = СохраняемыеНастройкиФормы();
	
	ЗаполнитьЗначенияСвойств(НастройкиФормы, ЭтотОбъект);
	ХранилищеНастроекДанныхФорм.Сохранить(
		МенеджерНастроекКлючОбъекта(), МенеджерНастроекКлючНастроек(), НастройкиФормы);
	
КонецПроцедуры

&НаСервере
Функция СохраняемыеНастройкиФормы()
	
	Результат = Новый Структура;
	Результат.Вставить("Склад");
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Назначение");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МенеджерНастроекКлючОбъекта()
	
	Возврат "ТоварыНаКонтролеКачества";
	
КонецФункции

&НаСервере
Функция МенеджерНастроекКлючНастроек()
	
	Возврат "НастройкиФормы";
	
КонецФункции

#КонецОбласти

#Область НастройкаСписков

&НаСервере
Процедура ИнициализацияНастройкиСписка()
	
	Отборы = Обработки.ТоварыНаКонтролеКачества.ПолучитьМакет("Отборы");
	АдресСхемыКомпоновкиДанныхНастройкиСписка = ПоместитьВоВременноеХранилище(Отборы, УникальныйИдентификатор);
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанныхНастройкиСписка);
	НастройкиСписка.Инициализировать(ИсточникДоступныхНастроек);
	НастройкиСписка.ЗагрузитьНастройки(Отборы.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСпискаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		НастройкаСпискаНаСервере(РезультатЗакрытия);
		ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановленОтбор()
	
	ЭлементыОтбора = НастройкиСписка.ПолучитьНастройки().Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Использование Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура НастройкаСпискаНаСервере(Знач КомпоновщикНастроек)
	
	НастройкиСписка.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	НастройкиСписка.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	Элементы.НастройкиОтбор.Видимость = УстановленОтбор();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройкиСпискаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("ВыборНастроек") Тогда
		ВыбратьНастройкиСпискаНаСервере(РезультатЗакрытия.КлючНастроек);
		ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьНастройкиСпискаНаСервере(Знач КлючНастроек)
	
	Отчеты.НастройкаСписка.ЗагрузитьНастройкиИзХранилища(
		"ТоварыНаКонтролеКачества.НастройкаСписка",
		КлючНастроек,
		НастройкиСписка);
	Элементы.НастройкиОтбор.Видимость = УстановленОтбор();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиСпискаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("ВыборНастроек") Тогда
		СохранитьНастройкиСпискаНаСервере(РезультатЗакрытия.КлючНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСпискаНаСервере(Знач КлючНастроек)
	
	Отчеты.НастройкаСписка.СохранитьНастройкиВХранилище(
		"ТоварыНаКонтролеКачества.НастройкаСписка",
		КлючНастроек,
		НастройкиСписка);
	
КонецПроцедуры

#КонецОбласти

#Область Исследования

&НаСервереБезКонтекста
Функция ИспользуютсяИсследованияТоваров()
	
	ИспользоватьИсследования = Ложь;
	Возврат ИспользоватьИсследования;
	
КонецФункции

#КонецОбласти

&НаСервере
Функция АктивнаяГиперссылка(ЗаявкаОформлена)
	
	Если ЗаявкаОформлена = Неопределено Тогда
		Возврат Элементы.ВсеГиперссылка;
	ИначеЕсли ЗаявкаОформлена = Истина Тогда
		Возврат Элементы.ЗаявкаОформленаГиперссылка;
	Иначе
		Возврат Элементы.ЗаявкаНеОформленаГиперссылка;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ГиперссылкаПриАктивизации(ИмяЭлемента, Инициализация = Ложь)
	
	Элемент = Элементы[ИмяЭлемента];
	Элементы.ВсеГиперссылка.Доступность = Истина;
	Элементы.ЗаявкаОформленаГиперссылка.Доступность = Истина;
	Элементы.ЗаявкаНеОформленаГиперссылка.Доступность = Истина;
	Элемент.Доступность = Ложь;
	
	Если Не Инициализация Тогда
		
		Если Элемент = Элементы.ВсеГиперссылка Тогда
			ЗаявкаОформлена = Неопределено;
		ИначеЕсли Элемент = Элементы.ЗаявкаОформленаГиперссылка Тогда
			ЗаявкаОформлена = Истина;
		Иначе
			ЗаявкаОформлена = Ложь;
		КонецЕсли;
		
		ЗапуститьЗаданиеЗагрузитьТовары();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НачалоТекущегоДня = НачалоДня(ТекущаяДатаСеанса());
	
	// Просрочненный срок контроля.
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Подсветка просроченного срока контроля.'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = НачалоТекущегоДня;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	
	// Партии заблокированные навсегда.
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Партии заблокированные навсегда.'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<разблокировка не планируется>'"));
	
КонецПроцедуры

&НаСервере
Функция ПоместитьАналитикиВХранилище(ИсключатьЗаявкиНаКонтроль)
	
	Строки = Новый Массив(Элементы.Товары.ВыделенныеСтроки.Количество());
	Индекс = 0;
	Для Каждого ИдентификаторСтроки Из Элементы.Товары.ВыделенныеСтроки Цикл
		Строки[Индекс] = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		Индекс = Индекс + 1;
	КонецЦикла;
	КлючСтроки =
		"КонтролируемаяПартия,
		|Номенклатура,
		|Характеристика,
		|Склад,
		|Назначение,
		|Помещение,
		|Серия,
		|ЭтоЗаявкаНаКонтроль";
	Аналитики = Объект.Товары.Выгрузить(Строки, КлючСтроки);
	Если ИсключатьЗаявкиНаКонтроль Тогда
		Аналитики = Аналитики.Скопировать(Новый Структура("ЭтоЗаявкаНаКонтроль", Ложь));
	КонецЕсли;
	Аналитики.Колонки.Удалить("ЭтоЗаявкаНаКонтроль");
	АдресВХранилище = ПоместитьВоВременноеХранилище(Аналитики, УникальныйИдентификатор);
	Возврат АдресВХранилище;
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитПартия(КонтролируемаяПартия)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтролируемаяПартия, "Партия");
	
КонецФункции

#КонецОбласти
